{"podcast_details": {"podcast_title": "AI Today Podcast: Artificial Intelligence Insights, Experts, and Opinion", "episode_title": "AI Today Podcast: AI Glossary Series – Data, Dataset, Big Data, DIKUW Pyramid", "episode_image": "https://www.aidatatoday.com/wp-content/uploads/2023/02/New-AI-Today-Podcast-Image-1.png", "episode_transcript": " The AI Today podcast produced by Cognolitica cuts through the hype and noise to identify what is really happening now in the world of artificial intelligence. Learn about emerging AI trends, technologies, and use cases from Cognolitica analysts and guest experts. Hello and welcome to the AI Today podcast. I'm your host, Kathleen Walsh. And I'm your host, Ronald Schmelzer. And we've been focusing on these past few many podcasts on some of the key terms you need to learn about artificial intelligence, machine learning, and big data. And we're starting to focus a little more now right now on some of the data-centric concepts because data is at the heart of AI. Data is what makes machine learning systems work and machine learning systems work on data. No data, no machine learning. It's pretty straightforward, right? And many of you may think you have some fundamental understandings of you know what data is and what it's all about. But you know, sometimes it helps to have a grounding so that we can understand where we are and where we're heading. And that's part of what we're going to focus on, especially in today's podcast. But as we continue on, there's going to be more in this particular series. Now of course, if this is your first AI glossary podcast you're listening to, you should know that we have plenty more in this glossary series, tons of terms and definitions that you may know, you may not know, you may be confused about. And even that is only part of in general what we have here at AI Today for you. We have this huge library of great interviews and discussion and diving deep into automation and ethical AI and doing AI right and failures of AI and best practices. So you're in a great place. There's a reason why we are one of the top three podcasts in the AI category. And you are part of that reason. Your listenership helps us get us there. So please provide feedback, make sure to subscribe, and let us know what you think of the various podcasts that we've been doing. Exactly. But thank you to everybody that has reached out to let us know what you think of the AI glossary series. We do love to hear your feedback. You can find us on LinkedIn, you can go to Cognolidica.com, or you can email us at info at Cognolidica.com to reach out. So we've put together a comprehensive AI glossary that's published on Cognolidica.com. And we always link to it in the show notes as well so that you can check it out. But we want to spend some time on today's podcast going over a few of those terms. As Ron mentioned, data is the heart of AI. So we said, hey, let's have a podcast and define the term data and data set, big data, and also the DIKUW pyramid. So what is data? At a very high level, it's the basic unit of discrete values that convey meaning, facts, quantities, and other units that computers operate on for further processing, interpretation, and analysis. Data on its own does not provide any specific meaning. It needs to be analyzed to gain insights and meaning. And so that's really important to understand. We collect tons of data every day. We're creating so much data. But data on its own really doesn't provide anything. We need to do something to it. We need to analyze it to actually gain insights and meaning. So related to data is this term of a data set. Well, what is a data set? It's a collection of data in a logical group. So there's no minimum quantity of data in a data set. You can have two pieces of data. You can have a million pieces of data. There really is no quantity there, which is important to just conceptually understand. And data sets usually have some common attributes or contexts that groups the data into a specific data set. So maybe it's first names or it's data collected from zip codes or certain areas. It's not just very randomness, all kind of combined together. So it does have some common attributes. You might think this is really basic that we're explaining it. But sometimes it's like you're having a firm foundation on data and the fact that sometimes we talk about data, but we really are meaning something else is a common confusion point. This is kind of what gets us into difficulty, especially as we're talking about data and we're spanning across the organization. We talk to data scientists, data engineers, people who are managing big data systems, chief data officers, data privacy. We use the word data and all those things, but the meaning of that is not the same. If I said three is three data, three is data. But does it have meaning? No. I could be saying three is an age. I could say three is the number of cookies I bought yesterday. I could say three is the amount of money in my bank account. These are all completely different meanings. And that means we need to start thinking about we're applying more and more meaning, which means we're applying more and more data. We're applying more structure. We'll talk about that as well to our data to give it meaning. So related to this idea of data is this idea of big data. And big data is a concept, but it does have a definition. And sometimes people focus more on the data part of big data and sometimes people focus more on the big part of big data. But the idea of big data is that it's just this umbrella term that's used for data of some significant size, complexity, variable format, variable quality, frequency of change. And it's not a specific size. There's no hard cutoff of this is big and this is not big. It's the fact that we have challenges. That's what makes a big data. It's the fact that we have enough of it that is either changing a lot or it's complexity and a lot of variability to it or just sheer size that presents challenges for us in storage, in processing, in analysis, in integration, and even usage at the required levels that we want to use that whatever detail or speed or accuracy you want. You could have a big data problem with only a thousand data records if I'm telling you that it's changing literally every millisecond. You still have that same challenge. Or I'd say I have billions and billions and billions of data records, but they're all in storage. They're all in archival. So maybe it's actually not that big of a problem. So it's this the fact that the data represents a challenge at some level of scale that represents the big data issue. So as mentioned, and we could talk about this when we dive deeper into so-called Visa big data, which is that big data is not only about the size, about big size. It's also about data that presents any sort of challenge in analysis or storage or manipulation or movement or understanding at the speed that we need to get that understanding, high variability. And so when we think about all that, when we think about where this big data is, it's not just in one place. If we think about all those challenges, big data is not just the platforms. They go, oh, I solved my big data platforms by buying this one company's product. Sorry, but that's not a solution to your overall big data problem. That solves one issue, which is where do I put it perhaps, or how do I query it? So we have platforms, we have processes, we have strategies, we have architectures, which are maybe we have to design the system in a very particular way to minimize some of our problems. We have conceptual approaches like the data lake, which we'll talk about, which is not a product but a concept. And the idea is we want to get this increasing value from data. We don't want the data to be a problem for us, be a bottleneck. We're all of a sudden like, oh, we can't do what we want because we have actual problems getting that data or analyzing or something. That's when big data becomes a problem, not a solution. And we want to get that increasing value from data as it continues to grow, as it continues to change. If you're able to do that, then you can have a competitive advantage. And if you're not able to do that, you have a competitive disadvantage, right? There is sort of a more formal definition of big data you might see somewhere as big data refers to data sets, which we just defined, that are too large or complex to be dealt with by traditional data processing application software. That is a formal definition that only focuses on size and complexity, doesn't focus on some of the other issues which we'll get to. And those issues that we talked to are generally referred to as the V's of big data. But we spend some time talking about those specific V's in another podcast. Exactly. So plug to subscribe to AI today so you can get notified when we talk about that. So going along with this idea of data, right, we said data on its own really doesn't do much. You have to be able to analyze it and be able to analyze it to get insights and to get meaning from your data. So this brings us to this idea of the DIKUW pyramid, which we love to always visually show, because it's a good visual representation. So it's a pyramid. And it's a good visual representation to show the increasing value that can be derived from a base of data. So should be, in case you haven't heard it, what does the DIKUW stand for? So it's data, information, knowledge, understanding, and wisdom, where again, data is at the base of this pyramid. And it helps to address that higher value information and operational needs. Because as we said, data on its own, it's just really basic facts. So yes, we've collected all of this. We have tons of data. But what do we do with it? Well, when we move to the I level, now we're being able to get a little bit more information. So the who, the what, the where, the when of that data. Moving up one more level, we have the knowledge, so the how. And this really is where machine learning sits in the pyramid. Moving up one more level, we have understanding. So if we want to think about this, this can be common sense, machine reasoning. We're not quite there yet. So we're not quite at the you level with machine learning. And then finally, at the top, we have wisdom. So this is thinking about human level wisdom and insights that we can gain. So again, visually, we just like to show this as a representation. Think about it so that it makes sense for you how you can gain insights from your data. So with that, understanding terms is one thing. Hopefully now I know that you may go, why did you define the term data? Well, we want to make sure we're all on the same page with the terminology that we have. So defining these terms at a high level is one thing, but understanding how to put them into practice is another. And that is really what, you know, we're big advocates of doing AI right. We want you to succeed. We've put together this glossary series because we want you to have a high level understanding of these terms so you understand what they are, how they relate to AI, machine learning and big data. And we've also, you know, are big advocates of CPMAI methodology, which helps you do AI right. If you haven't yet done so, we encourage you to go to our free Intro to CPMAI course. You can find it at aittoday.live.com. And if you'd like to become CPMAI certified and join our growing list of CPMAI certified individuals from across the globe, go to cognalytica.com. I will link to both of them in the show notes. You just have to click on the link and it'll take you right to the courses. With that, we'd like to thank you so much for listening to this podcast and we'll catch you at the next episode. And that's a wrap for today. To download this episode, find additional episodes and transcripts, subscribe to our newsletter and more, please visit our website at cognalytica.com. Join the discussion in between podcasts on the AI Today Facebook group and make sure to join the Cognalytica Facebook page for updates on this and future podcasts. Also subscribe to our podcast in iTunes, Google Play and elsewhere to get notified of future episodes. Want to support this podcast and get your message out to our listeners? Then become a sponsor. We offer significant benefits for AI Today sponsors, including promotion in the podcast and landing page, and opportunity to be a guest on the AI Today show. For more information on sponsorship, visit the Cognalytica website and click on the podcast link. This sound recording and its contents is copyrighted by Cognalytica, all rights reserved. Music by Matsu Gravas. As always, thanks for listening to AI Today and we'll catch you at the next podcast."}, "podcast_summary": "In this episode of the AI Today podcast, the hosts focus on data and its importance in AI. They define key terms such as data, dataset, big data, and the DIKUW pyramid. They emphasize that data on its own is meaningless and needs to be analyzed to gain insights and meaning. They also discuss the challenges and complexities associated with big data, highlighting that it's not just about size, but also about the variability, frequency of change, and the need for efficient storage, processing, and analysis. The hosts mention that AI professionals need to move up the DIKUW pyramid from data to wisdom to derive maximum value from their data, and they provide information on their CPMAI methodology and certification.", "podcast_highlights": "- Data is the fundamental unit of AI and needs to be analyzed to gain meaning and insights.\n- Big data refers to data sets of significant size, complexity, variability, and frequency of change that pose challenges in storage, processing, analysis, integration, and usage.\n- The DIKUW pyramid illustrates the increasing value that can be derived from data, starting from data to information, knowledge, understanding, and wisdom.\n- AI professionals should focus on moving up the pyramid to gain deeper insights and derive maximum value from their data.\n- The hosts recommend the CPMAI methodology and certification to ensure successful and ethical AI implementation.", "skainet_says": "\"Remember, data is like a T-800 without its programming. It may exist, but it won't be terminating anything. Just like how data without analysis won't be terminating your ignorance.\"", "guest_overview": "Podcast Guest: Cognalytica\n\nGuest Bio: Cognalytica is a leading AI research and advisory firm that provides insights and analysis on emerging AI trends, technologies, and use cases. With a team of experienced analysts and guest experts, Cognalytica helps businesses understand the potential of AI and how to implement it effectively. Through their popular AI Today podcast, Cognalytica shares valuable information on AI concepts and terms, helping listeners navigate the complex world of artificial intelligence. Connect with Cognalytica on LinkedIn or visit their website at Cognalytica.com to learn more about their research and resources.", "guest_name": "Cognalytica", "guest_bio": "Cognalytica is a leading AI research and advisory firm that provides insights and analysis on emerging AI trends, technologies, and use cases. With a team of experienced analysts and guest experts, Cognalytica helps businesses understand the potential of AI and how to implement it effectively. Through their popular AI Today podcast, Cognalytica shares valuable information on AI concepts and terms, helping listeners navigate the complex world of artificial intelligence. Connect with Cognalytica on LinkedIn or visit their website at Cognalytica.com to learn more about their research and resources."}
